app/controllers/wines_controller.rb

  def index
    @wines = Wine.all
---
SELECT "wines".* FROM "wines"

  def create
    @wine = Wine.new(wine_params)

    respond_to do |format|
      if @wine.save
---
INSERT INTO "wines" ("name", "description", "origin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    @wine.destroy
---
DELETE FROM "wines" WHERE "wines"."id" = $1  [["id", 1]]

    def set_wine
      @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 1]]